#lang r5rs
(define (A x y)
  (cond ((= y 0) 0)
        ((= x 0) (* 2 y))
        ((= y 1) 2)
        (else (A (- x 1) (A x (- y 1))))))

(A 1 10)
(A 0 (A 1 9))
(A 0 (A 0 (A 1 8)))
; 以此类推
(A 0 (A 0 (A 0 (A 0 (A 0 (A 0 (A 0 (A 0 (A 0 (A 0 2))))))))))
; 2^10 = 1024
; 当x = 1 时，结果是 2^y

(A 2 4)
(A 1 (A 2 3))
(A 1 (A 1 (A 2 2)))
(A 1 (A 1 (A 1 (A 2 1)))) 
(A 1 (A 1 (A 1 2)))
(A 1 (A 1 4)) ; 这里用了上面的结论。
(A 1 16)
; 省略
(A 1 16)
; 2^16 = 65536
; x=2 时 怎么说呢，就是迭代幂次 2^2^2^2^2.... 一共有y个2。用高德纳键号表示法是
; 2↑↑y

(A 3 3)
(A 2 (A 3 2))
(A 2 (A 2 (A 3 1)))
(A 2 (A 2 2))
(A 2 4)
(A 1 16)
; 2^16 = 65536
; 这个不要求数学定义。
